ashutosh887/Signet/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_LWIP_DHCP_DISCOVER_ADD_HOSTNAME=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
